{"Pokémon_Snap": "Pokémon Snap[a] is a 1999 first-person simulation video game with rail shooter style gameplay mechanics developed by HAL Laboratory and published by Nintendo for the Nintendo 64. It was first released in Japan in March 1999, and was later released in June 1999 in North America and in September 2000 for PAL regions. It is a spin-off game in the Pokémon series, being one of the first console-based games for it, and featuring many Pokémon rendered for the first time in real-time 3D. The game was re-released for the Wii's Virtual Console in December 2007 and Wii U's Virtual Console in 2016.Originally announced as a Nintendo 64DD title, development of Pokémon Snap was moved to the Nintendo 64 due to the 64DD's delays. The gameplay is similar to other first-person games, viewing from the perspective of protagonist Todd Snap as he moves automatically on a rail. The objective of the game is to take pictures of Pokémon with your camera, using items such as apples and \"pester balls\" to achieve better shots. After each round, players are judged based on the quality of their photos. The Virtual Console version features the ability to send pictures taken in the game to the Wii Message Board and send them to friends, whereas the Nintendo 64 cartridge could be taken to either Blockbuster or Lawson stores in North America and Japan to have pictures from the game printed on stickers.Its release was promoted heavily by Nintendo, including being featured in more than 86,000 hotels, and a contest to send the winner to Australia. By the end of 1999, Pokémon Snap sold 1.5 million copies, and was a strong rental title in 1999 after its release. It was met with a mostly positive reception by critics, described as \"addictive\" by IGN and Boys' Life, and \"innovative\" by Electric Playground. It has also been compared to other video games with photography, such as Afrika, Dead Rising, and Beyond Good & Evil. It has also been used as a notable example of video games with photography.A sequel called New Pokémon Snap was announced in 2020 and was released for the Nintendo Switch on April 30, 2021.[1]Todd Snap (トオル, Tooru), a Pokémon photographer, is summoned by Professor Oak to Pokémon Island, a place with a variety of climatic and geographic regions where Pokémon live relatively undisturbed by humans. Oak needs quality pictures to accompany his scientific findings, and knows from past experience that Todd is the right person for the job. Using a motorized, amphibious buggy named the Zero-One, Todd explores the island and takes photographs of the wide variety of Pokémon that inhabit its environments.From Professor Oak's research hub, the player can select between the game's levels and features using a menu system. The Zero-One follows a linear path throughout the level, similar to a rail shooter. Up to 60 pictures can be taken per visit. After completing a course, the player selects their best photos of each Pokémon to be rated by Professor Oak and added to the Pokémon Report. Scoring takes into account various aspects of the pictures, such as the Pokémon's size, its pose, and keeping the Pokémon in frame. Extra points are awarded for capturing a \"special\" pose or Pokémon, such as a surfing Pikachu, and if there are multiples of the same Pokémon within the frame. Scoring well in the Pokémon Report and photographing a wide variety of Pokémon is required to make progress in the game. Players can also use an \"Album Mark\" to bookmark their favorite pictures; this adds the pictures to a personal in-game album to view at a later date or show to friends.Players start out with only a camera, but as they progress, Professor Oak will provide them with a number of special accessories used to obtain better photographs. The game features seven levels: Beach, Tunnel, Volcano, River, Cave, Valley, and the special course \"Rainbow Cloud\". However, the staggered acquisition of accessories ensures that the player must re-explore the courses to discover new material. Levels must be replayed after acquiring new accessories in order to locate hidden Pokémon, alternate routes, or photographic opportunities that yield the best scores. The first accessory, apple-shaped Pokémon food, can be thrown to either stun or attract Pokémon. Another, \"Pester Balls\", are able to knock out Pokémon or flush them out of hiding. The Poké-Flute object is used in a variety of ways, such as awakening, irritating, or hatching Pokémon. It can also cause Pokémon to dance, and it can play three different songs, resulting in different dances from certain Pokémon. Additionally, players can obtain a Dash Engine for the Zero One, allowing the vehicle to accelerate and move faster than normal.The game features 63 of the original generation of 151 Pokémon.Pokémon Snap was developed by HAL Laboratory with assistance from Pax Softnica.[2] It originally started out as a non-Pokémon game called Jack and the Beanstalk. Named after the English fairy tale of the same name, the game was intended for the 64DD, a peripheral for the Nintendo 64. The game was developed at HAL's office on the second floor of the Nintendo Kanda building in Sudachō, Tokyo, by a development team called \"Jack and Beans\".[3] This name can be seen in the intro video of Pokémon Snap,[4] as well as in the credits.[5][6] Jack and the Beanstalk was first revealed in February 1995, a year before the Japanese release of the N64, but the game was not heard from again. No screenshots or videos have been publicly released of it, and little is known about what the game looked or played like. However, it is speculated[3] that some gameplay elements ended up in EarthBound 64, which started development in 1994 but was cancelled in 2000.[7] Benimaru Itoh, one of the art designers of EarthBound 64, said in an interview that the game was to feature seeds. When planted, these seeds would grow in real time, utilising the 64DD's internal clock.[8]On 27 February 1996, Nintendo affiliate Game Freak released Pocket Monsters Red and Green (released in the west as Pokémon Red and Blue). The pair of games became a sleeper hit and were followed the same year by manga and a trading card game. On 1 April 1997, an anime TV series debuted, turning the franchise into a national phenomenon that was later successfully exported to the rest of the world.[9] After it became clear that development of Jack and the Beanstalk wasn't going anywhere, the idea arose to turn it into a Pokémon spin-off. Satoru Iwata, one of the producers of the game, explained in a 2010 interview: \"Originally, Pokémon Snap for the Nintendo 64 system wasn't a Pokémon game, but rather a normal game in which you took photos, but the motivation for playing the game wasn't clear. We wondered what players would enjoy taking pictures of, and later on we made a somewhat forced switch to taking pictures of Pokémon.\" Masanobu Yamamoto, one of the character designers, initially had a negative reaction to the switch, since it meant that a lot of work he had put into the project had to be scrapped. He eventually realised the change was for the better though: \"That time, adopting the Pokémon world clarified what we should do and the direction we should head, and I came to like Pokémon, so I felt like that had saved us.\"[10][11]In 1999, Mother/EarthBound creator Shigesato Itoi posted a five-part article series about Jack and the Beanstalk on his site, 1101.com. The series includes interviews with various people involved with the game, including Satoru Iwata and Shigeru Miyamoto.[12]After turning the project into a Pokémon game, the title initially continued to be developed with support for the 64DD, an accessory for the Nintendo 64 that used magnetic disk-cartridges with a bigger storage capacity, and which featured an internet modem and internal clock. The device made its first public appearance at Shoshinkai 1996,[13] but after numerous delays, it eventually received a limited, Japan-only release on 1 December 1999, with only a handful of games. Almost all of the games that would have a 64DD version, including The Legend of Zelda: Ocarina of Time and Donkey Kong 64, were given a N64-only release. In January 1999, the magazine Dengeki Nintendo 64 announced that Pokémon Snap was also no longer appearing on the 64DD, being published only as a N64 cartridge.[14] Two months later, the game saw its release in Japan.Pokémon Snap was released on March 21, 1999, in Japan, July 26, 1999, in North America, and September 15, 2000, in PAL regions.The game has had several promotions made by both Nintendo and Blockbuster among others throughout the summer of 1999. Nintendo and Japanese convenience store Lawson formed a deal where people could bring their copies of Pokémon Snap and have pictures from the game printed in Japan.[15] Nintendo and Blockbuster formed a similar deal where Blockbuster would exclusively print stickers from players' copies of Pokémon Snap in the United States.[16] They hosted a contest called \"Take Your Best Shot\", where the player who produces the best picture from Pokémon Snap to Nintendo would win a trip to Australia.[17] Nintendo, partnering with LodgeNet, included Nintendo 64s with Pokémon Snap for more than 86,000 hotels with the intent of capitalizing on the Pokémon franchise for the holiday travel season.[18] Nintendo displayed Pokémon Snap at a Pokémon event called \"Pokémon League Summer Training Tour\".[19] The game's protagonist, Todd Snap, also briefly appeared in the Pokémon anime series shortly before the game's release.In December 2007, Pokémon Snap was re-released for the Wii as a Virtual Console title. While the original release supported the ability to take the cartridge into Blockbuster or Lawson stores in the United States to have taken pictures printed as stickers, the re-release replaced this with the ability to save photos to the Wii message board and share them with friends.[20][21]On April 4, 2016, Pokémon Snap was re-released in Japan for Wii U as a Virtual Console title.[22][23] This version was released in Europe and Australia on August 18, 2016, and North America on January 5, 2017.[24]Pokémon Snap was fourth on the chart for top selling games in Japan for the week of its release, March 18 to March 24.[25] For the week ending May 21, 1999, in Japan, it ranked fifth.[26] In the United States, Pokémon Snap sold in excess of 151,000 copies in the first three days of its release.[27] Since its release, it was the most rented game, up to October 22, 1999.[28] For the month of November, it was featured in the United States' top 10 list of best-selling video games.[29] For the week ending November 27, it ranked as the 10th best-selling video game, while it remained the most-rented video game for the same week.[30] By the end of 1999, Pokémon Snap was the sixth best-selling video game in the United States, having sold in excess of 1.5 million copies.[31] IGN attributed this success with \"well targeted promotions\" and the tie in with Blockbuster.[31] In the United Kingdom, it sold 6,500 units at launch, reaching No.9 in that week's charts, and replacing Perfect Dark as the top selling game in the N64 Top Ten chart.[32]Pokémon Snap received positive reviews from the media, scoring 77/100 on Metacritic.[33] Pokémon Snap was included among a test of video games that are fun, safe, easy to play, and of value for children.[41] Ars Technica editor Frank Caron commented that Pokémon Snap had become a \"fan favorite\", while author Marina D'Amato called it \"famous\".[20][42] Author Amit Dhir called it one of the most popular video games of 1999, alongside Gran Turismo and Final Fantasy VIII.[43] Kotaku described it as a \"cash-in branded title\".[44] Before its US release, IGN praised it as \"strange\", yet \"fun\".[45] Matt Casamassina of IGN called it an \"addictive, surprisingly fun\" game, noting however that \"Pokemaniacs are bound to be disappointed with the selection of Pocket Monsters in the game – roughly 62 out of a possible 151 in all.\"[39]GameSpot praised it as a \"refreshingly unique game\".[38] IGN editors Mark Bozon and Casamassina commented on Pokémon Snap's likelihood of becoming a Virtual Console title; the former called it a \"cult classic\" as well as a \"fresh and entertaining little package\". While Casamassina again criticized the lack of Pokémon and length, he noted that a Virtual Console re-release would be appropriate, due to it being \"simple and quick\".[46] IGN also called it a \"wonderful game for kids of all ages\", though again bemoaning its lack of length.[47] Official Nintendo Magazine gave the game an 85%.[40] Electronic Gaming Monthly gave the game an 83/100.[34] GamePro commented that while \"for Pokemon fans, this is a wonderful game\", others will not find it as fun.[36]Game Revolution called it \"an absolute must-have for Pokemon fans and kids in general\" but \"for the rest of us, it's actually a decent diversion\".[37] Electric Playground editor Victor Lucas called it \"innovative\" and \"worth taking a look at\".[48] Japanese gaming magazine, Famitsu, praised it for its \"sense of peace\", as well as its reproduction of \"the feel of a safari or a theme park.\"[49] The Detroit Free Press editor Mike Floyd commented that while it has a \"lot of initial flash\", it \"lacks depth to make it a great title\".[50] Wired editor Susan Arendt commented that while Pokémon Snap was considered the \"####### child of the Pokémon franchise\" by some, the people in her office loved it.[51] The Denver Post editor David Thomas commented that the concept of Pokémon Snap should have \"never worked\", but it turned out to be \"one of the most creative and entertaining games on the market\".[52]The Los Angeles Times editor Aaron Curtiss commented that while he strongly disliked the Pokémon franchise, Pokémon Snap was a great game.[53] In the book Pikachu's global adventure: the rise and fall of Pokémon, author Joseph Jay Tobin called it \"innovative\" in how it incorporated elements from the Pokémon franchise.[54] The magazine Boys' Life called it addictive, praising the reactions of the Pokémon as \"unique and always entertaining\".[55] Allgame editor Scott Alan Marriott commented that while the number of Pokémon was lacking and there were a small number of courses, the game has a \"substantial amount of replay value\".[56] Game Informer commented that Pokémon Snap was \"just as much fun as the main entries\" in the series.[57] Blockbuster nominated it for best Nintendo 64 game in its \"Blockbuster Awards\".[58]Pokémon Snap has been used to describe several other video games, as well as used as an example of photography and aiming in video games; the Washington Post editor John Gaudiosi called the adult video game Panty Raider a \"Victoria's Secret meets Pokemon Snap\".[59] Game Infowire called Beyond Good & Evil an \"odd mixture\" of Ratchet & Clank, Jak II, Metroid Prime, and Pokémon Snap.[60] Wired compared Sea Life Safari's premise to Pokémon Snap's.[61] They also compared Pokémon Snap to African Safari.[62] An application called Virtual Stakeout was compared by Kotaku to Pokémon Snap.[63] The book Patterns in game design used Pokémon Snap as an example of \"aim & shoot\" gameplay.[64] Author Raph Koster similarly used Pokémon Snap in order to describe video games with photography.[65] Author Shanna Compton used Pokémon Snap as an example of a video game that required players to produce photographs for judges to determine their quality.[66] Developer Wade Tinney attributed the inspiration for the game design of Snapshot Adventures: Secret of Bird Island to both Pokémon Snap and the video game Spore.[67] The PlayStation 3 video game Afrika was said by both UGO Networks and Shack News to be Pokémon Snap-like.[68][69] Dead Rising's photography mechanic was also likened to Pokémon Snap's by Kotaku.[70]The Virtual Console re-release was met with generally mixed reception. Nintendo Life editor Marcel Van Duyn praised it as a \"fun and a relaxing break from the other Pokémon titles\", but criticized it as \"super short\".[71] RPGamer editor Anna Marie Neufeld criticized it for having \"zero replayability\" and \"if nothing else, a good way to waste an afternoon or evening with the Wii.\"[72] IGN editor Lucas M. Thomas called the photo sharing feature a positive of its release, while criticizing its limited selection of Pokémon, similar to the review of the Nintendo 64 version from IGN. He added that a sequel updated to include Wii controls and Pokémon from recent generations would be welcome.[73] IGN included Pokémon Snap in its wish list of Nintendo 3DS remakes, commenting that it could take advantage of the 3DS' ability to produce stereoscopic 3D photos would be an enjoyable feature for Pokémon Snap.[74] IGN also included Pokémon Snap in their retrospective of the Pokémon video game series, praising it as \"fun and innovative\".[75] IGN praised it for its visual prowess, citing how it allows players in the United States to see Pokémon in three dimensions.[76] In their Pokémon Snap retrospective, Game, Set, Watch editor Danny Cowan commented that it was a \"turnoff for fans\", calling how overlooked it was \"tragic\".[77] Retronauts speculated that the popularity of Pokémon Snap was due to being released at the height of Pokémon fandom. However, one of the commentators on the podcast, Justin Haywald, found this odd, calling it “horrible.” The podcast discussed briefly the prospects of a Pokémon Snap sequel, feeling that the Nintendo 3DS' gyroscope and augmented reality cards could be used, citing Steel Diver for its use of the former feature. Retronauts member Jeremy Parish commented that if they didn't make such a sequel, it's because they are “stupid and don't like money.”[78] IGN commented that a Pokémon game better than Black and White was Pokémon Snap, stating that \"It hasn't become stale\", \"It has better Pokémon\", and \"It made the Pokémon world feel real\". They commented that none of the past Pokémon games \"have managed to make the little critters seem as alive as Pokemon Snap did\", and praised the 3D modeling, calling it \"glorious\".[79] 1UP.com used Pokémon Snap as an example of a game that would use the Wii U controller's gyroscope to look around, calling it \"The coolest version of Pokémon Snap ever\".[80]Game Freak director Junichi Masuda has stated multiple times that he would love to see a sequel, and that they wouldn't stop Nintendo from making it happen.[81]"}